tarasii/stm32f103_hal_devices/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "i2c.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "i2c.h"
#include "ds1307.h"
#include "bmp180.h"
#include "hmc5883.h"
#include "mpu6050.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	//HAL_StatusTypeDef res;
	DS1307_time tm;
	BMP180_t BMP180_Data;
	HMC5883L_XYZ_StructTypeDef xyz;
	int16_t ag[6];
	//uint8_t i, tmp;
	//uint8_t buf[20];
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */

	printf("Hello!\n\r");
	
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
	
	if (I2C_IsDeviceConnected(&hi2c1, BMP180_I2C_ADDRESS) == HAL_OK){
		printf("BMP180 connected\n\r");
	} else {
		printf("BMP180 No connected\n\r");
	}
	BMP180_Init(&BMP180_Data);

	if (I2C_IsDeviceConnected(&hi2c1, MPU6050_I2C_ADDRESS) == HAL_OK){
		printf("MPU6050 connected\n\r");
	} else {
		printf("MPU6050 No connected\n\r");
	}	

	MPU6050(MPU6050_DEFAULT_ADDRESS);
	MPU6050_initialize();
	
	printf("MPU6050 %02x \n\r", MPU6050_getDeviceID());

	MPU6050_setI2CBypassEnabled(true);
	MPU6050_setI2CMasterModeEnabled(false);
	
	//MPU6050_setSlaveRegister(0, HMC5883L_RA_MODE);
	

	if (I2C_IsDeviceConnected(&hi2c1, HMC5883L_I2C_ADDRESS) == HAL_OK){
		printf("HMC5883 connected\n\r");
	} else {
		printf("HMC5883 No connected\n\r");
	}	
	HMC5883L_Initialize();
	printf("HMC5883 RAW:%d %d %0d \n\r", HMC5883L_GetX(), HMC5883L_GetZ(), HMC5883L_GetY());	
	
	MPU6050_setI2CBypassEnabled(false);
	MPU6050_setI2CMasterModeEnabled(true);

	//read hmc5883 id
//	MPU6050_setSlaveAddress(0, 128 + HMC5883L_I2C_ADDRESS);
//	MPU6050_setSlaveRegister(0, HMC5883L_RA_ID_A);
//	MPU6050_setSlaveDataLength(0, 3);	
//	MPU6050_setSlaveEnabled(0, true);
//			printf("6050 slave:%02x %02x %02x\n\r", 
//	MPU6050_getExternalSensorByte(0),
//	MPU6050_getExternalSensorByte(1),
//	MPU6050_getExternalSensorByte(2));

//	MPU6050_setSlaveAddress(0, HMC5883L_I2C_ADDRESS);
//	MPU6050_setSlaveRegister(0, HMC5883L_RA_DATAX_H);
//	MPU6050_setSlaveDataLength(0, 0);	
//	MPU6050_setSlaveWriteMode(0, false);
//	//MPU6050_setSlaveWordGroupOffset(0, true);
//	MPU6050_setSlaveEnabled(0, true);
	
	MPU6050_setSlaveAddress(0, 0x80 + HMC5883L_I2C_ADDRESS);
	MPU6050_setSlaveRegister(0, HMC5883L_RA_DATAX_H);
	MPU6050_setSlaveDataLength(0, 6);	
	MPU6050_setSlaveWriteMode(0, false);
	MPU6050_setSlaveWordGroupOffset(0, true);
	MPU6050_setSlaveWordByteSwap(0, false);
	MPU6050_setSlaveEnabled(0, true);
	printf("6050 slave:%d %d %d \n\r", 
		(int16_t) MPU6050_getExternalSensorWord(0),
		(int16_t) MPU6050_getExternalSensorWord(2),
		(int16_t) MPU6050_getExternalSensorWord(4));

//	if (I2C_IsDeviceConnected(&hi2c1, DS1307_I2C_ADDRESS) == HAL_OK){
//		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
//		tm = DS1307_GetTime();
//		DS1307_PrintTime(&tm);	
//	}	

	//HAL_UART_Transmit(&huart1, buf, 6, 100);

		HAL_Delay(1000);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		HAL_Delay(1000);
		HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
		

		xyz.X = (int16_t) MPU6050_getExternalSensorWord(0);
		xyz.Z = (int16_t) MPU6050_getExternalSensorWord(2);
		xyz.Y = (int16_t) MPU6050_getExternalSensorWord(4);
//		printf("6050 slave:%d %d %d %d \n\r", 
//			,
//			(int16_t) MPU6050_getExternalSensorWord(2),
//			(int16_t) MPU6050_getExternalSensorWord(4), MPU6050_getSlaveEnabled(0));

    BMP180_StartTemperature(&BMP180_Data);
		HAL_Delay(BMP180_Data.Delay / 1000);
		BMP180_ReadTemperature(&BMP180_Data);
		
		BMP180_StartPressure(&BMP180_Data, BMP180_Oversampling_UltraHighResolution);
		HAL_Delay(BMP180_Data.Delay / 1000);
		BMP180_ReadPressure(&BMP180_Data);

//		HMC5883L_GetXYZ(&xyz);	
		printf("T:%2.3f; P:%6d(%3.1f); Alt: %3.2fm; ang:%3.3f;\n\r",
				BMP180_Data.Temperature,
				BMP180_Data.Pressure, BMP180_GetHgPressure(BMP180_Data.Pressure), 
				BMP180_Data.Altitude, HMC5883L_CountAngle(&xyz)
		);
		
		//MPU6050_GetRawAccelGyro(ag);
		//printf("T:%2.3f; X:%5d; Y:%5d; Z:%5d;\n\r", MPU6050_GetTemperature(MPU6050_GetRawTemperature()), ag[0], ag[1], ag[2]);
		printf("T:%2.3f; X:%5d; Y:%5d; Z:%5d;\n\r", 
			MPU6050_computeTemperature(MPU6050_getTemperature()), 
			MPU6050_getRotationX(), MPU6050_getRotationY(), MPU6050_getRotationZ());
		
//		if (I2C_IsDeviceConnected(&hi2c1, DS1307_I2C_ADDRESS) == HAL_OK){
//			tm = DS1307_GetTime();
//			printf("%02d:%02d:%02d\n\r", tm.hours, tm.minutes, tm.seconds);
//		}
  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
